04_tests/reports/performance/raw/interface-comparison-2026-08-28/monolith-list-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 666 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 1704 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 2708 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 3732 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 4841 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 5861 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 6775 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 7831 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 8908 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 10004 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 11083 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 12141 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 13244 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 14308 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 15357 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 16478 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 17551 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 18667 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 19771 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 20905 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=6.31ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 41824   2090.759686/s
    checks_succeeded...: 100.00% 41824 out of 41824
    checks_failed......: 0.00%   0 out of 41824

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=4.69ms min=1.47ms med=4.47ms max=50.4ms  p(90)=5.55ms p(95)=6.31ms
      { expected_response:true }...: avg=4.69ms min=1.47ms med=4.47ms max=50.4ms  p(90)=5.55ms p(95)=6.31ms
    http_req_failed................: 0.00%  0 out of 20912
    http_reqs......................: 20912  1045.379843/s

    EXECUTION
    iteration_duration.............: avg=4.77ms min=1.56ms med=4.55ms max=54.03ms p(90)=5.64ms p(95)=6.42ms
    iterations.....................: 20912  1045.379843/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 326 MB 16 MB/s
    data_sent......................: 3.4 MB 172 kB/s



running (20.0s), 0/5 VUs, 20912 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s