04_tests/reports/performance/raw/interface-comparison-2026-08-28/monolith-list-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 986 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 1977 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 2921 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 3922 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 4946 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 5985 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 7020 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 7966 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 9015 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 10047 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 11046 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 12044 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 13004 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 13971 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 14774 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 15779 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 16811 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 17859 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 18909 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 19953 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=6.3ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 39920   1995.600381/s
    checks_succeeded...: 100.00% 39920 out of 39920
    checks_failed......: 0.00%   0 out of 39920

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=4.92ms min=2.2ms med=4.76ms max=29.01ms p(90)=5.78ms p(95)=6.3ms 
      { expected_response:true }...: avg=4.92ms min=2.2ms med=4.76ms max=29.01ms p(90)=5.78ms p(95)=6.3ms 
    http_req_failed................: 0.00%  0 out of 19960
    http_reqs......................: 19960  997.800191/s

    EXECUTION
    iteration_duration.............: avg=5ms    min=2.4ms med=4.84ms max=29.16ms p(90)=5.86ms p(95)=6.39ms
    iterations.....................: 19960  997.800191/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 311 MB 16 MB/s
    data_sent......................: 3.3 MB 164 kB/s



running (20.0s), 0/5 VUs, 19960 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s